Gecko05/SSD1351-Driver-Library/build/test/mocks/mock_stm32l1xx_hal.h
/* AUTOGENERATED FILE. DO NOT EDIT. */
#ifndef _MOCK_STM32L1XX_HAL_H
#define _MOCK_STM32L1XX_HAL_H

#include "stm32l1xx_hal.h"

/* Ignore the following warnings, since we are copying code */
#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic push
#endif
#if !defined(__clang__)
#pragma GCC diagnostic ignored "-Wpragmas"
#endif
#pragma GCC diagnostic ignored "-Wunknown-pragmas"
#pragma GCC diagnostic ignored "-Wduplicate-decl-specifier"
#endif

void mock_stm32l1xx_hal_Init(void);
void mock_stm32l1xx_hal_Destroy(void);
void mock_stm32l1xx_hal_Verify(void);




#define HAL_Delay_Ignore() HAL_Delay_CMockIgnore()
void HAL_Delay_CMockIgnore(void);
#define HAL_Delay_Expect(delay) HAL_Delay_CMockExpect(__LINE__, delay)
void HAL_Delay_CMockExpect(UNITY_LINE_TYPE cmock_line, uint32_t delay);
typedef void (* CMOCK_HAL_Delay_CALLBACK)(uint32_t delay, int cmock_num_calls);
void HAL_Delay_StubWithCallback(CMOCK_HAL_Delay_CALLBACK Callback);
#define HAL_SPI_Transmit_Ignore() HAL_SPI_Transmit_CMockIgnore()
void HAL_SPI_Transmit_CMockIgnore(void);
#define HAL_SPI_Transmit_Expect(hspi, data, len, timeout) HAL_SPI_Transmit_CMockExpect(__LINE__, hspi, data, len, timeout)
void HAL_SPI_Transmit_CMockExpect(UNITY_LINE_TYPE cmock_line, SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, uint32_t timeout);
typedef void (* CMOCK_HAL_SPI_Transmit_CALLBACK)(SPI_HandleTypeDef* hspi, uint8_t* data, uint16_t len, uint32_t timeout, int cmock_num_calls);
void HAL_SPI_Transmit_StubWithCallback(CMOCK_HAL_SPI_Transmit_CALLBACK Callback);
#define HAL_GPIO_WritePin_Ignore() HAL_GPIO_WritePin_CMockIgnore()
void HAL_GPIO_WritePin_CMockIgnore(void);
#define HAL_GPIO_WritePin_Expect(gpio_port, gpio_pin, state) HAL_GPIO_WritePin_CMockExpect(__LINE__, gpio_port, gpio_pin, state)
void HAL_GPIO_WritePin_CMockExpect(UNITY_LINE_TYPE cmock_line, int* gpio_port, int gpio_pin, GPIO_PinState state);
typedef void (* CMOCK_HAL_GPIO_WritePin_CALLBACK)(int* gpio_port, int gpio_pin, GPIO_PinState state, int cmock_num_calls);
void HAL_GPIO_WritePin_StubWithCallback(CMOCK_HAL_GPIO_WritePin_CALLBACK Callback);

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
